In [1]:
!pip install mysql-connector

Collecting mysql-connector
  Downloading mysql-connector-2.2.9.tar.gz (11.9 MB)
Building wheels for collected packages: mysql-connector
  Building wheel for mysql-connector (setup.py): started
  Building wheel for mysql-connector (setup.py): finished with status 'done'
  Created wheel for mysql-connector: filename=mysql_connector-2.2.9-cp39-cp39-win_amd64.whl size=247961 sha256=0f08f5690eeebaff1fa3580c344f995d42263ce4bf9786c9af38e69e67186b1d
  Stored in directory: c:\users\rubina\appdata\local\pip\cache\wheels\7b\14\39\5aad423666e827dfe9a1fbcd111ac17171e7c9865d570780ce
Successfully built mysql-connector
Installing collected packages: mysql-connector
Successfully installed mysql-connector-2.2.9

In [1]:
# Connecting with database

import mysql.connector

database = mysql.connector.connect(
           host="localhost",
           user="root",
           password="",
           database = "pythons_8am")
db = database.cursor()

In [2]:
db.execute("SELECT * FROM students")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 80.0, 82.0, 92.0, 94.0, 10.0, 400.0, 80.0, 'A')
(2, 'Shyama', 60.0, 70.0, 88.0, 92.0, 89.0, 400.0, 78.0, 'B')
(3, 'Krishna', 60.0, 70.0, 78.0, 91.0, 82.0, 400.0, 80.0, 'B+')
(4, 'Sakxham', 90.0, 84.0, 78.0, 83.0, 81.0, 400.0, 83.0, 'A')
(5, 'Rubina', 94.0, 76.0, 78.0, 83.0, 89.0, 400.0, 83.0, 'A')
(7, 'Ansuka', 87.0, 88.0, 72.0, 83.0, 89.0, 400.0, 83.0, 'A')
(8, 'Ansuka', 87.0, 88.0, 72.0, 83.0, 89.0, 400.0, 83.0, 'A')

In [3]:
# To insert value into db table

sql = """INSERT INTO students (name, physics, chemistry, math, english, nepali, total, per, grade) 
VALUES ('Ansuka', 87, 88, 72, 83, 89, 400, 83, 'A');"""
db.execute(sql)
database.commit()

In [4]:
# To fetch table values

db.execute("SELECT * FROM students")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 80.0, 82.0, 92.0, 94.0, 10.0, 400.0, 80.0, 'A')
(2, 'Shyama', 60.0, 70.0, 88.0, 92.0, 89.0, 400.0, 78.0, 'B')
(3, 'Krishna', 60.0, 70.0, 78.0, 91.0, 82.0, 400.0, 80.0, 'B+')
(4, 'Sakxham', 90.0, 84.0, 78.0, 83.0, 81.0, 400.0, 83.0, 'A')
(5, 'Rubina', 94.0, 76.0, 78.0, 83.0, 89.0, 400.0, 83.0, 'A')
(7, 'Ansuka', 87.0, 88.0, 72.0, 83.0, 89.0, 400.0, 83.0, 'A')
(8, 'Ansuka', 87.0, 88.0, 72.0, 83.0, 89.0, 400.0, 83.0, 'A')
(9, 'Ansuka', 87.0, 88.0, 72.0, 83.0, 89.0, 400.0, 83.0, 'A')

In [5]:
# To delete table value

sql = "DELETE FROM students WHERE sn = 6"
db.execute(sql)
database.commit()

In [6]:
# To update table value

sql = "UPDATE `students` SET `name` = 'Krishna' WHERE `SN` = 3";
db.execute(sql)
database.commit()

In [8]:
# WAP to take data from user and insert it to the table also CRUD

name = input("Enter name: ")
physics = float(input("Enter physics marks: "))
chemistry = float(input("Enter chemistry marks: "))
math = float(input("Enter math marks: "))
english = float(input("Enter english marks: "))
nepali = float(input("Enter nepali marks: "))
total = physics+chemistry+math+english+nepali
per = total/5
if per>=80:
    grade = 'A'
elif per>=60:
    grade = 'B'
elif per>=45:
    grade = 'C'
else:
    grade = 'F'

sql = """INSERT INTO students (name, physics, chemistry, math, english, nepali, total, per, grade) 
         VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)"""

values = (name, physics, chemistry, math, english, nepali, total, per, grade)

db.execute(sql, values)
database.commit()

Enter name: Siyana
Enter physics marks: 79
Enter chemistry marks: 78
Enter math marks: 77
Enter english marks: 76
Enter nepali marks: 75

In [10]:
sql = "DELETE FROM students WHERE sn = 8"
db.execute(sql)
database.commit()

In [11]:
sql = "UPDATE `students` SET `name` = 'Aanchal' WHERE `SN` = 9";
db.execute(sql)
database.commit()

In [12]:
db.execute("SELECT * FROM students")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 80.0, 82.0, 92.0, 94.0, 10.0, 400.0, 80.0, 'A')
(2, 'Shyama', 60.0, 70.0, 88.0, 92.0, 89.0, 400.0, 78.0, 'B')
(3, 'Krishna', 60.0, 70.0, 78.0, 91.0, 82.0, 400.0, 80.0, 'B+')
(4, 'Sakxham', 90.0, 84.0, 78.0, 83.0, 81.0, 400.0, 83.0, 'A')
(5, 'Rubina', 94.0, 76.0, 78.0, 83.0, 89.0, 400.0, 83.0, 'A')
(7, 'Ansuka', 87.0, 88.0, 72.0, 83.0, 89.0, 400.0, 83.0, 'A')
(9, 'Aanchal', 87.0, 88.0, 72.0, 83.0, 89.0, 400.0, 83.0, 'A')
(10, 'Siyana', 79.0, 78.0, 77.0, 76.0, 75.0, 385.0, 77.0, 'B')